app/views/classrooms/_form.html.erb

SELECT "options".* FROM "options"
---
  <div class="field">
    <%= form.collection_check_boxes(:option_ids, Option.all, :id, :name_with_initial) %>