app/views/classrooms/index.html.erb

		    <td><%= classroom.building.name %></td>
        <td><%= classroom.options.map { |option| option.name }.join(', ').html_safe %></td>
---
SELECT "options".* FROM "options" INNER JOIN "classrooms_options" ON "options"."id" = "classrooms_options"."option_id" WHERE "classrooms_options"."classroom_id" = ?  [["classroom_id", 1]]