app/controllers/admin/buildings_controller.rb

SELECT "buildings".* FROM "buildings"
---
  def index
    @buildings = Building.all

SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_building
    @building = Building.find(params[:id])