app/controllers/admin/classrooms_controller.rb

  def index
    @classrooms = Classroom.all
---
SELECT "classrooms".* FROM "classrooms"

    def set_classroom
      @classroom = Classroom.find(params[:id])
---
SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_building
      @building = Building.find(params[:building_id])
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]