app/controllers/admin/options_controller.rb

  def index
    @options = Option.all
---
SELECT "options".* FROM "options"