app/views/admin/classrooms/_form.html.erb

SELECT "options".* FROM "options"
---
    <%= form.label :options %>
    <%= Option.all.length == 0 ? 'None' : form.collection_check_boxes(:option_ids, Option.all, :id, :name_with_initial) %>