app/views/admin/classrooms/index.html.erb

        <div class="classroomContent">
          <p><%= classroom.options.map { |option| option.name }.join(', ').html_safe %></p>
---
SELECT "options".* FROM "options" INNER JOIN "classrooms_options" ON "options"."id" = "classrooms_options"."option_id" WHERE "classrooms_options"."classroom_id" = ?  [["classroom_id", 1]]