app/views/buildings/show.html.erb

  <tbody>
  <% @building.classrooms.each do |classroom| %>
---
SELECT "classrooms".* FROM "classrooms" WHERE "classrooms"."building_id" = ?  [["building_id", 1]]

      <td><%= classroom.name %></td>
      <td><%= classroom.options.map { |option| option.name }.join(', ').html_safe %></td>
---
SELECT "options".* FROM "options" INNER JOIN "classrooms_options" ON "options"."id" = "classrooms_options"."option_id" WHERE "classrooms_options"."classroom_id" = ?  [["classroom_id", 1]]