app/controllers/api/v1/classrooms_controller.rb

SELECT "classrooms".* FROM "classrooms"
---
  def index
    @classrooms = Classroom.all