app/controllers/buildings_controller.rb

  def index
    @buildings = Building.all
---
SELECT "buildings".* FROM "buildings"

  def create
    @building = Building.new(building_params)

    respond_to do |format|
      if @building.save
---
INSERT INTO "buildings" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Wijnhaven 69"], ["created_at", "2018-03-19 07:45:32.585727"], ["updated_at", "2018-03-19 07:45:32.585727"]]

  def destroy
    @building.destroy
---
DELETE FROM "buildings" WHERE "buildings"."id" = ?  [["id", 1]]

    def set_building
      @building = Building.find(params[:id])
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]