app/controllers/calendars_controller.rb

  def index
    @calendars = Calendar.all
---
SELECT "calendars".* FROM "calendars"

  def create
    @calendar = Calendar.new(calendar_params)

    respond_to do |format|
      if @calendar.save
---
INSERT INTO "calendars" ("classroom", "startTime", "endTime", "reservation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["classroom", "H4.113"], ["startTime", "1"], ["endTime", "2"], ["reservation", "Testreserve"], ["created_at", "2018-02-12 10:25:52.767699"], ["updated_at", "2018-02-12 10:25:52.767699"]]

    def set_calendar
      @calendar = Calendar.find(params[:id])
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]