app/controllers/classrooms_controller.rb

  def index
    @classrooms = Classroom.all
---
SELECT "classrooms".* FROM "classrooms"

  def show
	  @reservation = Reservation.new
    @reservations = Reservation.where(classroom_id: params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."classroom_id" = ?  [["classroom_id", 1]]

  def create
    @classroom = Classroom.new(classroom_params)

    respond_to do |format|
      if @classroom.save
---
INSERT INTO "classrooms" ("name", "building_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["building_id", 1], ["created_at", "2018-03-19 07:57:12.940411"], ["updated_at", "2018-03-19 07:57:12.940411"]]

  def update
    respond_to do |format|
      if @classroom.update(classroom_params)
---
UPDATE "classrooms" SET "building_id" = ?, "updated_at" = ? WHERE "classrooms"."id" = ?  [["building_id", 2], ["updated_at", "2018-03-19 07:58:06.847602"], ["id", 1]]

    def set_classroom
      @classroom = Classroom.find(params[:id])
---
SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]