app/controllers/devices_controller.rb

SELECT "devices".* FROM "devices"
---
  def index
    @devices = Device.all

INSERT INTO "devices" ("name", "classroom_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Pi"], ["classroom_id", 1], ["created_at", "2018-03-19 08:26:52.136603"], ["updated_at", "2018-03-19 08:26:52.136603"]]
---
  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save

UPDATE "devices" SET "temperature" = ?, "updated_at" = ? WHERE "devices"."id" = ?  [["temperature", 10], ["updated_at", "2018-05-26 12:01:40.052413"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @device.update(device_params)

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_device
      @device = Device.find(params[:id])