app/controllers/options_controller.rb

SELECT "options".* FROM "options"
---
  def index
    @options = Option.all

INSERT INTO "options" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Computer"], ["created_at", "2018-03-19 08:08:34.229563"], ["updated_at", "2018-03-19 08:08:34.229563"]]
---
  def create
    @option = Option.new(option_params)

    respond_to do |format|
      if @option.save

UPDATE "options" SET "name" = ?, "updated_at" = ? WHERE "options"."id" = ?  [["name", "> 25 personen"], ["updated_at", "2018-05-25 10:18:09.180106"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @option.update(option_params)

SELECT  "options".* FROM "options" WHERE "options"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_option
      @option = Option.find(params[:id])