app/controllers/reservations_controller.rb

  def index
    @reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def create
    @reservation = Reservation.new(reservation_params)
	# @reservation.user_id = current_user.id
	@reservation.user_id = 1
    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("date", "title", "from", "to", "user_id", "classroom_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["date", "2018-05-20"], ["title", "Test"], ["from", 1], ["to", 3], ["user_id", 1], ["classroom_id", 1], ["created_at", "2018-05-10 10:32:56.562004"], ["updated_at", "2018-05-10 10:32:56.562004"]]

    def set_reservation
      @reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]